<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 驱动方式
    'type'   => 'File',
    // 缓存保存目录
    'path'   => '',
    // 缓存前缀
    'prefix' => '',
    // 缓存有效期 0表示永久缓存
    'expire' => 0,
    // 应用缓存前缀
    'app_cache_prefix' => [
        // 短信验证码
        'sms_code' => 'sms_code_cache_',
        // 管理员权限列表缓存
        'admin_auth' => 'admin_auth_list_',
        // 系统权限列表缓存
        'auth_list' => 'sys_auth_list',
        // 权限菜单对应表
        'auth_menu' => 'sys_auth_menu'
    ],
];
